# Terraform environment at24
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
Acquiring state lock. This may take a few moments...
module.rbac.data.azurerm_resource_group.hub: Reading...
data.azurerm_private_dns_zone.postgres: Reading...
data.azurerm_private_dns_zone.postgres: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com]
module.rbac.data.azurerm_resource_group.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.postgres_server.data.azurerm_client_config.current: Reading...
module.rbac.data.azurerm_resource_group.spoke: Reading...
data.azurerm_subnet.postgres: Reading...
data.azurerm_user_assigned_identity.admin: Reading...
module.postgres_server.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.appsettings.data.azurerm_resource_group.hub: Reading...
module.rbac.data.azurerm_resource_group.spoke: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at24]
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.rbac.data.azurerm_storage_account.use_lease[0]: Reading...
module.appsettings.data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
data.azurerm_subnet.postgres: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at24/providers/Microsoft.Network/virtualNetworks/vnetssaltinnauth001at24/subnets/Postgres]
data.azurerm_user_assigned_identity.admin: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at24/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mipgsqladminaltinnauth001at24]
module.rbac.data.azurerm_storage_account.use_lease[0]: Read complete after 0s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at24/providers/Microsoft.Storage/storageAccounts/staltinnauth001at24]
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at24/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001at24]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_federated_identity_credential.aks_federation["https://norwayeast.oic.prod-aks.azure.com/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/4a142a74-1861-42c5-9014-36cc46ed71a0/"] will be created
  + resource "azurerm_federated_identity_credential" "aks_federation" {
      + audience            = [
          + "api://AzureADTokenExchange",
        ]
      + id                  = (known after apply)
      + issuer              = "https://norwayeast.oic.prod-aks.azure.com/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/4a142a74-1861-42c5-9014-36cc46ed71a0/"
      + name                = "Aks"
      + parent_id           = (known after apply)
      + resource_group_name = "rgaltinnauthregister001at24"
      + subject             = "system:serviceaccount:default:altinn-register"
    }

  # azurerm_resource_group.register will be created
  + resource "azurerm_resource_group" "register" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "rgaltinnauthregister001at24"
      + tags     = (known after apply)
    }

  # azurerm_user_assigned_identity.register will be created
  + resource "azurerm_user_assigned_identity" "register" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "norwayeast"
      + name                = "mialtinnauthregister001at24"
      + principal_id        = (known after apply)
      + resource_group_name = "rgaltinnauthregister001at24"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)
    }

  # static_data.static will be created
  + resource "static_data" "static" {
      + data   = {
          + "created_at" = "Tuesday, 02-Jan-18 23:12:01 UTC"
        }
      + id     = (known after apply)
      + output = (known after apply)
    }

  # module.postgres_server.azurerm_postgresql_flexible_server.postgres_server will be created
  + resource "azurerm_postgresql_flexible_server" "postgres_server" {
      + administrator_login           = (known after apply)
      + auto_grow_enabled             = true
      + backup_retention_days         = 14
      + create_mode                   = "Default"
      + delegated_subnet_id           = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at24/providers/Microsoft.Network/virtualNetworks/vnetssaltinnauth001at24/subnets/Postgres"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "psqlsrvaltinnauthregister001at24"
      + private_dns_zone_id           = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com"
      + public_network_access_enabled = false
      + resource_group_name           = "rgaltinnauthregister001at24"
      + sku_name                      = "B_Standard_B1ms"
      + storage_mb                    = 32768
      + storage_tier                  = "P4"
      + version                       = "16"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = false
          + tenant_id                     = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
        }
    }

  # module.postgres_server.azurerm_postgresql_flexible_server_active_directory_administrator.admin["cddd14e6-74fd-4907-a07f-68c3580b2b26"] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "admin" {
      + id                  = (known after apply)
      + object_id           = "cddd14e6-74fd-4907-a07f-68c3580b2b26"
      + principal_name      = "mipgsqladminaltinnauth001at24"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "rgaltinnauthregister001at24"
      + server_name         = "psqlsrvaltinnauthregister001at24"
      + tenant_id           = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
    }

  # module.postgres_server.azurerm_postgresql_flexible_server_configuration.configuration["azure.extensions"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "configuration" {
      + id        = (known after apply)
      + name      = "azure.extensions"
      + server_id = (known after apply)
      + value     = "HSTORE"
    }

  # module.rbac.azurerm_role_assignment.use_app_configuration[0] will be created
  + resource "azurerm_role_assignment" "use_app_configuration" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "App Configuration Data Reader"
      + scope                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.rbac.azurerm_role_assignment.use_lease[0] will be created
  + resource "azurerm_role_assignment" "use_lease" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at24/providers/Microsoft.Storage/storageAccounts/staltinnauth001at24"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.rbac.azurerm_role_assignment.use_masstransit[0] will be created
  + resource "azurerm_role_assignment" "use_masstransit" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Service Bus Data Owner"
      + scope                            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at24/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001at24"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @andreasisnes |
| Action | `push` |
| Working Directory | `src/apps/Altinn.Register/infra` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/at24/altinn.register.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_at24_altinn.register.tfstate.tfplan`